Revit 2016 API
BuiltInFailures.ConstraintFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.ConstraintFailures type exposes the following members.
Properties
Name | Description
UndeletedConstraints
 A Dimension that is labeled or has Lock and/or EQ Constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the Constraints or "OK" to leave elements constrained..
UndeletedConstraintsInGroup
 A labeled dimension is being deleted, but the corresponding constraint belongs to a group and will not be changed. You can change it in group edit mode later.
See Also
BuiltInFailures.ConstraintFailures Class
Autodesk.Revit.DB Namespace